# config.py

# ========================
# 训练参数
# ========================
EPISODES = 3000
BATCH_SIZE = 64
BUFFER_SIZE = 1000

# ========================
# DQN参数
# ========================
GAMMA = 0.99
LR = 1e-3

# ========================
# 探索参数
# ========================
EPSILON_START = 1.0
EPSILON_MIN = 0.05
EPSILON_DECAY = 0.998

# ========================
# target network
# ========================
TARGET_UPDATE = 5

# ========================
# 训练启动阈值
# ========================
MIN_BUFFER_SIZE = 200